### Planned Changes to Server Infrastructure
#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Plan 📖 `success`
#### Terraform Validation 🤖 `success`

<details><summary>Show Plan</summary>

```terraform
module.server.random_password.session_secret_value: Refreshing state... [id=none]
random_string.resource_code: Refreshing state... [id=7o8xwaka]
module.server.random_password.password: Refreshing state... [id=none]
github_repository_environment.this: Refreshing state... [id=indok-api:production]
data.azurerm_client_config.current: Reading...
module.server.data.azurerm_key_vault_secret.postmark_api_token: Reading...
module.server.data.azurerm_client_config.current: Reading...
module.server.data.azurerm_key_vault_secret.feide_client_secret: Reading...
module.server.module.resource_group.azurerm_resource_group.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00MmJiMGZiYS0wZmIyLTRjZWItYmRiZi1jNmNjNmFmZTI1MDY7b2JqZWN0SWQ9Y2IxNTc2YmItMjYxOC00NWEwLTgzNjMtMDU3NWQ3ZTdlNDEyO3N1YnNjcmlwdGlvbklkPTBmNmI1YzhlLWNjMTUtNGFmNC1iYTYwLTQwYWE4MzAxOTU1ZTt0ZW5hbnRJZD1mMTdhY2Y1Ni1hYjEzLTQzZmEtYjlkNy1mMGUwZDYyODMyNmM=]
module.server.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00MmJiMGZiYS0wZmIyLTRjZWItYmRiZi1jNmNjNmFmZTI1MDY7b2JqZWN0SWQ9Y2IxNTc2YmItMjYxOC00NWEwLTgzNjMtMDU3NWQ3ZTdlNDEyO3N1YnNjcmlwdGlvbklkPTBmNmI1YzhlLWNjMTUtNGFmNC1iYTYwLTQwYWE4MzAxOTU1ZTt0ZW5hbnRJZD1mMTdhY2Y1Ni1hYjEzLTQzZmEtYjlkNy1mMGUwZDYyODMyNmM=]
module.server.module.managed_identity.azurerm_user_assigned_identity.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.ManagedIdentity/userAssignedIdentities/managed-identity-7o8xwaka]
module.server.module.database.azurerm_private_dns_zone.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.Network/privateDnsZones/production-7o8xwaka.postgres.database.azure.com]
module.server.module.vnet.azurerm_virtual_network.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.Network/virtualNetworks/vnet-7o8xwaka]
module.server.module.redis.azurerm_private_dns_zone.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net]
module.server.module.container_app_environment.azurerm_log_analytics_workspace.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.OperationalInsights/workspaces/ca-log-workspace-7o8xwaka]
module.server.module.redis.azurerm_redis_cache.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.Cache/redis/redis7o8xwaka]
module.server.module.redis.azurerm_subnet.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.Network/virtualNetworks/vnet-7o8xwaka/subnets/redis-subnet-7o8xwaka]
module.server.module.container_app_environment.azurerm_subnet.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.Network/virtualNetworks/vnet-7o8xwaka/subnets/ca-subnet-7o8xwaka]
module.server.module.database.azurerm_subnet.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.Network/virtualNetworks/vnet-7o8xwaka/subnets/pg-subnet-7o8xwaka]
module.server.module.database.azurerm_private_dns_zone_virtual_network_link.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.Network/privateDnsZones/production-7o8xwaka.postgres.database.azure.com/virtualNetworkLinks/pg-7o8xwaka.com]
module.server.azurerm_role_assignment.key_vault_user: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.Authorization/roleAssignments/3f3dc4d0-bea7-e10e-7ed4-2495fd459a06]
module.server.azurerm_role_assignment.rg_reader: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.Authorization/roleAssignments/dfd26610-34ca-2698-65fb-50110851658a]
module.server.module.key_vault.azurerm_key_vault.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.KeyVault/vaults/key-vault-7o8xwaka]
module.server.module.redis.azurerm_private_dns_zone_virtual_network_link.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net/virtualNetworkLinks/vnet-private-zone-link]
module.server.module.database.azurerm_postgresql_flexible_server.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.DBforPostgreSQL/flexibleServers/pg-fs-7o8xwaka]
module.server.data.azurerm_key_vault_secret.feide_client_secret: Read complete after 3s [id=https://shared-key-vault-altht.vault.azure.net/secrets/feide-client-secret/299f08ebe57941dda63f30a792037af0]
module.server.data.azurerm_key_vault_secret.postmark_api_token: Read complete after 3s [id=https://shared-key-vault-altht.vault.azure.net/secrets/postmark-api-token/fb5215c57cd64a349554c5830934b085]
module.server.module.database.azurerm_postgresql_flexible_server_database.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.DBforPostgreSQL/flexibleServers/pg-fs-7o8xwaka/databases/pg-fs-db-7o8xwaka]
module.server.module.container_app_environment.azurerm_container_app_environment.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.App/managedEnvironments/ca-env-7o8xwaka]
module.server.azurerm_key_vault_secret.session_secret: Refreshing state... [id=https://key-vault-7o8xwaka.vault.azure.net/secrets/session-secret/d25064f2b362478e82fbadf42021336c]
module.server.azurerm_key_vault_secret.db_connection_string: Refreshing state... [id=https://key-vault-7o8xwaka.vault.azure.net/secrets/db-connection-string/722a31c6866e4ee5ba94f11514653007]
module.server.azurerm_key_vault_secret.redis_connection_string: Refreshing state... [id=https://key-vault-7o8xwaka.vault.azure.net/secrets/redis-connection-string/299b4c157e03410794728208e582ae51]
module.server.module.redis.azurerm_private_endpoint.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.Network/privateEndpoints/endpoint-7o8xwaka]
module.server.azurerm_container_app.worker: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.App/containerApps/worker-7o8xwaka]
module.server.azurerm_container_app.server: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.App/containerApps/server-7o8xwaka]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.server.azurerm_container_app.server will be updated in-place
  ~ resource "azurerm_container_app" "server" {
        id                            = "/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.App/containerApps/server-7o8xwaka"
        name                          = "server-7o8xwaka"
        tags                          = {
            "environment" = "production"
            "workspace"   = "default"
        }
        # (8 unchanged attributes hidden)

      ~ template {
            # (2 unchanged attributes hidden)

          ~ container {
              ~ image             = "ghcr.io/rubberdok/server:8213751d37023d3826b17304272e48f208207aee" -> "ghcr.io/rubberdok/server:latest"
                name              = "server"
                # (5 unchanged attributes hidden)

              ~ env {
                    name  = "SENTRY_RELEASE"
                  ~ value = "8213751d37023d3826b17304272e48f208207aee" -> "20915345cb70cff2537f12c0a7cac3f64be851b5"
                }
              ~ env {
                  ~ name        = "REDIS_CONNECTION_STRING" -> "AZURE_STORAGE_CONTAINER_NAME"
                  - secret_name = "redis-connection-string" -> null
                  + value       = "appstore7o8xwakacontainer"
                }
              ~ env {
                  ~ name        = "DATABASE_CONNECTION_STRING" -> "AZURE_STORAGE_ACCOUNT_NAME"
                  - secret_name = "database-connection-string" -> null
                  + value       = "appstore7o8xwaka"
                }
              ~ env {
                  ~ name        = "FEIDE_CLIENT_SECRET" -> "REDIS_CONNECTION_STRING"
                  ~ secret_name = "feide-client-secret" -> "redis-connection-string"
                }
              ~ env {
                  ~ name        = "SESSION_SECRET" -> "DATABASE_CONNECTION_STRING"
                  ~ secret_name = "session-secret" -> "database-connection-string"
                }
              ~ env {
                  ~ name        = "POSTMARK_API_TOKEN" -> "FEIDE_CLIENT_SECRET"
                  ~ secret_name = "postmark-api-token" -> "feide-client-secret"
                }
              + env {
                  + name        = "SESSION_SECRET"
                  + secret_name = "session-secret"
                }
              + env {
                  + name        = "POSTMARK_API_TOKEN"
                  + secret_name = "postmark-api-token"
                }

                # (21 unchanged blocks hidden)
            }

          ~ init_container {
              ~ image             = "ghcr.io/rubberdok/server:8213751d37023d3826b17304272e48f208207aee" -> "ghcr.io/rubberdok/server:latest"
                name              = "migrate"
                # (5 unchanged attributes hidden)

              ~ env {
                    name  = "SENTRY_RELEASE"
                  ~ value = "8213751d37023d3826b17304272e48f208207aee" -> "20915345cb70cff2537f12c0a7cac3f64be851b5"
                }
              ~ env {
                  ~ name        = "REDIS_CONNECTION_STRING" -> "AZURE_STORAGE_CONTAINER_NAME"
                  - secret_name = "redis-connection-string" -> null
                  + value       = "appstore7o8xwakacontainer"
                }
              ~ env {
                  ~ name        = "DATABASE_CONNECTION_STRING" -> "AZURE_STORAGE_ACCOUNT_NAME"
                  - secret_name = "database-connection-string" -> null
                  + value       = "appstore7o8xwaka"
                }
              ~ env {
                  ~ name        = "FEIDE_CLIENT_SECRET" -> "REDIS_CONNECTION_STRING"
                  ~ secret_name = "feide-client-secret" -> "redis-connection-string"
                }
              ~ env {
                  ~ name        = "SESSION_SECRET" -> "DATABASE_CONNECTION_STRING"
                  ~ secret_name = "session-secret" -> "database-connection-string"
                }
              ~ env {
                  ~ name        = "POSTMARK_API_TOKEN" -> "FEIDE_CLIENT_SECRET"
                  ~ secret_name = "postmark-api-token" -> "feide-client-secret"
                }
              + env {
                  + name        = "SESSION_SECRET"
                  + secret_name = "session-secret"
                }
              + env {
                  + name        = "POSTMARK_API_TOKEN"
                  + secret_name = "postmark-api-token"
                }

                # (18 unchanged blocks hidden)
            }
        }

        # (8 unchanged blocks hidden)
    }

  # module.server.azurerm_container_app.worker will be updated in-place
  ~ resource "azurerm_container_app" "worker" {
        id                            = "/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.App/containerApps/worker-7o8xwaka"
        name                          = "worker-7o8xwaka"
        tags                          = {
            "environment" = "production"
            "workspace"   = "default"
        }
        # (7 unchanged attributes hidden)

      ~ template {
            # (2 unchanged attributes hidden)

          ~ container {
              ~ image             = "ghcr.io/rubberdok/server:8213751d37023d3826b17304272e48f208207aee" -> "ghcr.io/rubberdok/server:latest"
                name              = "worker"
                # (5 unchanged attributes hidden)

              ~ env {
                    name  = "SENTRY_RELEASE"
                  ~ value = "8213751d37023d3826b17304272e48f208207aee" -> "20915345cb70cff2537f12c0a7cac3f64be851b5"
                }
              ~ env {
                  ~ name        = "REDIS_CONNECTION_STRING" -> "AZURE_STORAGE_CONTAINER_NAME"
                  - secret_name = "redis-connection-string" -> null
                  + value       = "appstore7o8xwakacontainer"
                }
              ~ env {
                  ~ name        = "DATABASE_CONNECTION_STRING" -> "AZURE_STORAGE_ACCOUNT_NAME"
                  - secret_name = "database-connection-string" -> null
                  + value       = "appstore7o8xwaka"
                }
              ~ env {
                  ~ name        = "FEIDE_CLIENT_SECRET" -> "REDIS_CONNECTION_STRING"
                  ~ secret_name = "feide-client-secret" -> "redis-connection-string"
                }
              ~ env {
                  ~ name        = "SESSION_SECRET" -> "DATABASE_CONNECTION_STRING"
                  ~ secret_name = "session-secret" -> "database-connection-string"
                }
              ~ env {
                  ~ name        = "POSTMARK_API_TOKEN" -> "FEIDE_CLIENT_SECRET"
                  ~ secret_name = "postmark-api-token" -> "feide-client-secret"
                }
              + env {
                  + name        = "SESSION_SECRET"
                  + secret_name = "session-secret"
                }
              + env {
                  + name        = "POSTMARK_API_TOKEN"
                  + secret_name = "postmark-api-token"
                }

                # (18 unchanged blocks hidden)
            }
        }

        # (7 unchanged blocks hidden)
    }

  # module.server.module.blob_storage.azurerm_storage_account.main will be created
  + resource "azurerm_storage_account" "main" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = true
      + default_to_oauth_authentication    = false
      + enable_https_traffic_only          = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + location                           = "norwayeast"
      + min_tls_version                    = "TLS1_2"
      + name                               = "appstore7o8xwaka"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "rg-7o8xwaka"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
    }

  # module.server.module.blob_storage.azurerm_storage_container.main will be created
  + resource "azurerm_storage_container" "main" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "appstore7o8xwakacontainer"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "appstore7o8xwaka"
    }

Plan: 2 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @larwaa, Action: `pull_request`*